Repository: kapucuonur/chatAi_App
Catalog: lib/l10n/app_*.arb
Languages: tr

# hintText
source: Type a message or speak...
tr: Mesaj yaz veya konuş...

# thinking
source: Gemini is thinking...
tr: Gemini düşünüyor...

# welcomeMessage
source: Hi! I'm Gemini 2.5 Flash. You can send images or speak to me!
tr: Merhaba! Ben Gemini 2.5 Flash. Resim gönderebilir, konuşarak mesaj atabilirsin!

# imagePromptGallery
source: What's in this image? Can you describe it?
tr: Bu resimde ne var? Açıklayabilir misin?

# imagePromptCamera
source: I just took this photo, what do you see?
tr: Bu fotoğrafı çektim, ne görüyorsun?

source: Gallery
tr: Galeri

source: Camera
tr: Kamera

# startListening
source: Start voice input
tr: Sesli giriş başlat

# stopListening
source: Stop voice input
tr: Sesli girişi durdur

# micPermissionDenied
source: Microphone permission denied. Please enable in settings.
tr: Mikrofon izni verilmedi. Ayarlardan açın.

# cameraPermissionDenied
source: Camera permission denied. Please enable in settings.
tr: Kamera izni verilmedi. Ayarlardan açın.

# speechNotAvailable
source: Speech recognition not available
tr: Ses tanıma mevcut değil

# speechError
source: Speech recognition error
tr: Ses tanıma hatası

# imageError
source: Image loading error
tr: Resim yükleme hatası

source: Camera error
tr: Kamera hatası
